Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: སྙིང་རྗེ་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སྤྱོད་དམ། མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ལ་སྤྱོད་དམ། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ལ་སྤྱོད་དམ། ཉན་ཐོས་ཀྱི་ལམ་དང་། རང་སངས་རྒྱས་ཀྱི་ལམ་ལ་སྤྱོད་དམ། བྱང་ཆུབ་སེམས་དཔའི་ལམ་དང་། སངས་རྒྱས་ཀྱི་ལམ་ལ་སྤྱོད་དམ། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་།
en: Abiding in that meditative stability, if you engage in the emptiness of inherent existence, whatever virtuous attributes you engage in through body, speech, and mind, you will achieve them with little trouble, whether you dispense generosity, keep [the vows of] ethical discipline, practice tolerance, undertake perseverance, develop meditative stability, or cultivate wisdom; engage in the emptiness of internal phenomena; engage in [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentity; practice the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, or the noble eightfold path; engage in the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, or the meditative stabilities and the dhāraṇī gateways; engage in the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, great empathetic joy, great equanimity, or the distinct qualities of the buddhas; engage in the thirty-two major marks of a great person or in the eighty excellent minor marks; practice the path of the śrāvakas; practice the path of the pratyekabuddhas; practice the path of the bodhisattvas and the path of the buddhas; engage in the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, or individual enlightenment; engage in all-aspect omniscience; engage in bringing beings to maturation; or engage in refining the buddhafields.’ {

source: དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ལ་སྤྱོད་དམ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་སྤྱོད་དམ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་སྤྱོད་དམ། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བ་ལ་སྤྱོད་ཀྱང་རུང་སྟེ། དགེ་བའི་ཆོས་དེ་དག་ལས་གྲོན་ཆུང་ངུས་འགྲུབ་པར་འགྱུར་རོ་ཞེས་འདེམས་ཤིང་རྗེས་སུ་སྟོན་ཏེ།
en: Ki.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པས་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་དེ།
en: VIII: 94} “Subhūti, when bodhisattva great beings practice the perfection of wisdom in that manner, through skill in means they act for the benefit of beings.

source: །སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་ནས། བར་འགའ་ཡང་ལས་མི་བྱེད་པར་མི་འགྱུར་གྱི། དགེ་བ་ཐམས་ཅད་ཚོལ་ཞིང་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་དེ།
en: Commencing from their first setting of the mind on enlightenment, they never again become ineffective, but explore all virtuous actions and act for the benefit of beings.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་བསྙེན་བཀུར་བྱེད་ཅིང་། སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་སྟེ།
en: At all times they continuously venerate the lord buddhas, and journey from buddhafield to buddhafield.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལས་ཆོས་ཐོས་པ་དེ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་ཀྱི་བར་དུ་ཚེ་རབས་རྗེས་ཀྱང་ནམ་དུ་ཡང་རྣམ་པར་ཆུད་མི་ཟ་སྟེ།
en: They never again squander the Dharma that they have heard from those lord buddhas, even after transmigrating from this life, until they have attained consummate buddhahood in unsurpassed, complete enlightenment.

source: རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་གཟུངས་ཐོབ་ཅིང་ལུས་ཀྱི་དབང་པོ་འམ། ངག་གི་དབང་པོ་འམ། ཡིད་ཀྱི་དབང་པོ་མི་ཉམ་པ་ཡིན།
en: At all times they continuously acquire the dhāraṇīs and their physical faculties, verbal faculties, and mental faculties are undiminished.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཤིན་ཏུ་བསྒོམས་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཤིན་དུ་བསྒོམས་པ་དེ་ལམ་ཐམས་ཅད་ཤིན་དུ་བསྒོམས་པར་འགྱུར་ཏེ།
en: If you ask why, it is because at all times these bodhisattva great beings have continuously and absolutely cultivated all-aspect omniscience, so that, having absolutely cultivated all-aspect omniscience, they absolutely cultivate all paths.

source: ཉན་ཐོས་ཀྱི་ལམ་མམ། རང་སངས་རྒྱས་ཀྱི་ལམ་མམ། བྱང་ཆུབ་སེམས་དཔའི་ལམ་འམ། སངས་རྒྱས་ཀྱི་ལམ་ཤིན་དུ་བསྒོམས་པར་འགྱུར།
en: That is to say, they absolutely cultivate the path of the śrāvakas, the path of the pratyekabuddhas, the path of the bodhisattvas, and the path of the buddhas.

source: མངོན་པར་ཤེས་པ་གང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་རྣམ་པར་ཆུད་མི་ཟ་བའི་ཚུལ་གྱིས་ཕན་པར་འགྱུར་བ་དེ་དག་ཀྱང་ཤིན་དུ་བསྒོམས་པར་འགྱུར་ཏེ།
en: Bodhisattva great beings absolutely cultivate the extrasensory powers that are also beneficial since they have not squandered them.

source: རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་མངོན་པར་ཤེས་པ་དེ་དག་ལ་གནས་ཤིང་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་ན། འགྲོ་བ་ལྔའི་འཁོར་བར་འཁོར་ཡང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་ཀྱང་ཡོངས་སུ་མི་ཉམ་མོ།
en: Maintaining those extrasensory powers that originate from the maturation [of past actions], when they act for the benefit of beings, their all-aspect omniscience is never diminished even though they may roam in cyclic existence with its five realms of living beings.

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། རང་བཞིན་སྟོང་པ་ཉིད་ལ་གནས་ཤིང་། ཐབས་མཁས་པས་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་དོ།
en: Subhūti, when bodhisattva great beings practice the perfection of wisdom in that manner, they dwell in the emptiness of inherent existence, and, through skill in means, they act for the benefit of beings. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། རང་བཞིན་སྟོང་པ་ཉིད་ལ་གནས་ཤིང་། སེམས་ཅན་ཤེས་རབ་འཆལ་བ་ཅན་བློ་ཆུང་བ་རྣམས་མཐོང་ན། འདི་སྐད་འདེམས་ཤིང་རྗེས་སུ་སྟོན་ཏེ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they dwell in the emptiness of inherent existence, and if they see beings who are stupid and narrow-minded, they should instruct and advise them, saying, ‘Come here, noble children!

source: ཚུར་རིགས་ཀྱི་བུ་ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་གང་ཅི་བྱེད་ཀྱང་རུང་སྟེ། དེ་ཐམས་ཅད་རང་བཞིན་སྟོང་པ་ཉིད་དུ་རྟོགས་ཤིག་དང་། ཁྱོད་ཀྱི་ལས་ཐམས་ཅད་བདུད་རྩིའི་འབྲས་བུར་འགྱུར་ཏེ། མཐར་བདུད་རྩིར་འགྱུར་རོ།
en: Whatever actions you may do, whether of body, speech, or mind, you should understand that these are all the emptiness of inherent existence, and then all these actions of yours will become the fruit of [deathless] nectar and terminate in [deathless] nectar.

source: །རང་བཞིན་སྟོང་པ་ཉིད་ལ་ནི་གང་འཇིག་པར་འགྱུར་བ་འམ། ཡོངས་སུ་ཉམ་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ཆོས་གང་ཡང་དམིགས་སུ་མེད་དོ།
en: In the emptiness of inherent existence there is nothing apprehensible at all, such that it could perish or degenerate.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རང་བཞིན་སྟོང་པ་ཉིད་ནི་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར། རང་བཞིན་སྟོང་པ་ཉིད་ལས་ཡོངས་སུ་ཉམ་པའི་ཆོས་ཀྱང་གང་ཡང་མེད་དོ།
en: If you ask why, the emptiness of inherent existence will not degenerate, nor is there anything at all that can degenerate from the emptiness of inherent existence.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་ནི་དངོས་པོ་ཡོད་པ་ཡང་མ་ཡིན། དངོས་པོ་མེད་པ་ཡང་མ་ཡིན།
en: If you ask why, it is because the emptiness of inherent existence is neither an entity nor is it a nonentity.

source: ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ལ་ཅི་ཞིག་ཡོངས་སུ་ཉམ་པར་འགྱུར་ཞེས།
en: What will degenerate when all phenomena have the essential nature of nonentity?’ “

source: རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ།
en: Subhūti, when bodhisattva great beings practice the perfection of wisdom in that manner, {Ki.

source: ཐབས་མཁས་པས་སེམས་ཅན་རྣམས་ལ་འདེམས་ཤིང་རྗེས་སུ་སྟོན་ཏོ།
en: VIII: 95} they should instruct and advise beings through skill in means.

source: །དེ་ལྟར་འདེམས་ཤིང་རྗེས་སུ་སྟོན་པའི་ཚེ། ནམ་ཡང་རྗེས་སུ་མ་བསྒྲུབས་པ་མ་ཡིན།
en: When they instruct and advise in that manner, they will never again be ineffective.

source: དེ་ནི་བདག་ཀྱང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བླངས་ཤིང་གནས་པ་ཡིན་གཞན་ཡང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན།
en: They themselves adopt and maintain the paths of the ten virtuous actions and they also encourage others to [adopt] the paths of the ten virtuous actions.

source: བདག་ཀྱང་བསླབ་པའི་གནས་ལྔ་ཡང་དག་པར་བླངས་ཤིང་གནས་པ་ཡིན། གཞན་ཡང་བསླབ་པའི་གནས་ལྔ་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན།
en: They themselves adopt and maintain the five precepts, and they also encourage others [to adopt] the five precepts.

source: བདག་ཀྱང་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་གསོ་སྦྱིན་ལ་ཉེ་བར་གནས་པ་ཡང་དག་པར་བླངས་ཤིང་གནས་པ་ཡིན། གཞན་ཡང་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་གསོ་སྦྱིན་ལ་ཉེ་བར་གནས་པར་ཡང་དག་པར་སྐུལ་བ་ཡིན།
en: They themselves adopt and attend the eightfold observance, and they also encourage others to attend the eightfold observance. “

source: བདག་ཀྱང་བསམ་གཏན་དང་པོ་ལ་སྙོམས་པར་འཇུག་པ་ཡིན། གཞན་ཡང་བསམ་གཏན་དང་པོ་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན།
en: They themselves are absorbed in the first meditative concentration and they also encourage other beings toward the first meditative concentration.

source: བདག་ཀྱང་བསམ་གཏན་གཉིས་པ་དང་། བསམ་གཏན་གསུམ་པ་དང་། བསམ་གཏན་བཞི་པ་ལ་ཡང་དག་པར་སྙོམས་པར་འཇུག་པ་ཡིན། གཞན་ཡང་བསམ་གཏན་བཞི་པ་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན།
en: They themselves are absorbed in the second meditative concentration, the third meditative concentration, and the fourth meditative concentration and they also encourage others toward the fourth meditative concentration [and so forth].

source: བདག་ཀྱང་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་བྱམས་པ་ལ་གནས་པ་ཡིན།
en: At all times they themselves continuously maintain loving kindness, and at all times they also continuously encourage others to cultivate loving kindness.

source: གཞན་ཡང་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་བྱམས་པ་སྒོམ་པ་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན། བདག་ཀྱང་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ལ་གནས་པ་ཡིན།
en: At all times they themselves continuously maintain compassion, empathetic joy, and equanimity, and at all times they also continuously encourage others to cultivate equanimity [and so forth].

source: གཞན་ཡང་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་བཏང་སྙོམས་སྒོམ་པ་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན།
en: They speak in praise of equanimity [and so forth], and they also speak in praise of and take empathetic delight in those other beings being absorbed in equanimity [and so forth].

source: བདག་ཀྱང་རྟག་ཏུ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་འཇུག་པ་ཡིན། གཞན་ཡང་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན།
en: They themselves are always absorbed in the absorption of the sphere of infinite space, the absorption of the sphere of infinite consciousness, the absorption of the sphere of nothing-at-all, and the absorption of the sphere of neither perception nor nonperception, and they also encourage others toward the absorption of the sphere of neither perception nor nonperception [and so forth]. “

source: བདག་ཀྱང་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་སྒོམ་པ་ཡིན། གཞན་ཡང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན།
en: They themselves cultivate the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment and they also encourage others [to cultivate] the thirty-seven factors conducive to enlightenment [and so forth]. “

source: བདག་ཀྱང་རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ལ་སློབ་པ་ཡིན། གཞན་ཡང་རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན། བདག་ཀྱང་འཕགས་པའི་བདེན་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་།
en: They themselves train in the three gateways of liberation, and they also encourage others [to train in] the three gateways of liberation.

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་སློབ་པ་ཡིན། གཞན་ཡང་གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན།
en: They themselves train in the truths of the noble ones, the eight aspects of liberation, the nine serial steps of meditative absorption, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways, and they also encourage others [to train in] the dhāraṇī gateways [and so forth]. “

source: བདག་ཀྱང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ལ་སློབ་པ་ཡིན། གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན། བདག་ཀྱང་མི་འཇིགས་པ་བཞི་དང་།
en: They themselves train in the ten powers of the tathāgatas, and they also encourage others [to train in] the ten powers of the tathāgatas.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སློབ་པ་ཡིན། གཞན་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན།
en: They themselves train in the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas, and they also encourage others [to train in] the eighteen distinct qualities of the buddhas [and so forth].

source: བདག་ཀྱང་མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ལ་སློབ་པ་ཡིན། གཞན་ཡང་མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན།
en: They themselves train in the thirty-two major marks of a great person and the eighty excellent minor marks and they also encourage others to [train in] the thirty-two major marks of a great person and the eighty excellent minor marks. “

source: བདག་ཀྱང་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུའི་ཤེས་པ་སྐྱེད་ཅིང་། དེ་ལ་མི་གནས་པ་ཡིན། གཞན་ཡང་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་འགོད་པ་ཡིན།
en: They themselves develop knowledge of the fruit of entering the stream to nirvāṇa, and without dwelling in it, they also establish others in the fruit of entering the stream to nirvāṇa.

source: བདག་ཀྱང་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པའི་འབྲས་བུའི་ཤེས་པ་སྐྱེད་ཅིང་དེ་ལ་མི་གནས་པ་ཡིན། གཞན་ཡང་དགྲ་བཅོམ་པའི་འབྲས་བུ་ལ་རབ་ཏུ་འགོད་པ་ཡིན།
en: They themselves develop knowledge of the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, and the fruit of arhatship, and without dwelling in them, they also establish others in the fruit of arhatship [and so forth].

source: བདག་ཀྱང་རང་བྱང་ཆུབ་ཀྱི་ལམ་སྐྱེད་ཅིང་དེ་ལ་མི་གནས་པ་ཡིན། གཞན་ཡང་རང་བྱང་ཆུབ་ལ་རབ་ཏུ་འགོད་པ་ཡིན།
en: They themselves develop the path of individual enlightenment, and without dwelling in it, they also establish others in individual enlightenment.

source: བདག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ལམ་སྐྱེད་པ་ཡིན། གཞན་ཡང་ལམ་དེ་ལ་འདེམས་ཤིང་རྗེས་སུ་སྟོན་པ་དང་། གཞོག་ཅིང་འདུལ་བ་དང་འགོད་པ་ཡིན་ཏེ།
en: They themselves develop the path of unsurpassed, complete enlightenment, and they also instruct, advise, settle, discipline, and establish others in that path. {

source: རབ་འབྱོར་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་གཟུང་སྟེ། རང་བཞིན་སྟོང་པ་ཉིད་ལ་གནས་ཤིང་། སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་པའི་ཚེ།
en: Ki.VIII: 96} “Subhūti, when bodhisattva great beings practice the perfection of wisdom in that manner, commencing from their first setting of the mind on enlightenment, they dwell in the emptiness of inherent existence and act for the benefit of beings.

source: ནམ་ཡང་ལས་མེད་པར་གནས་པ་མ་ཡིན་ནོ། །གསོལ་པ།
en: Never again are they ineffective.” “

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྟོང་པ་ལགས་ན། རང་བཞིན་སྟོང་པ་ཉིད་ལ་ནི་སེམས་ཅན་ཡང་མི་དམིགས། ཆོས་ཀྱང་མི་དམིགས། ཆོས་མ་ལགས་པ་དེ་ཡང་མི་དམིགས་ན། བཅོམ་ལྡན་འདས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དོན་དུ་ཡང་དག་པར་འཇུག་པ་ལགས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, if in that manner all phenomena are empty of inherent existence—and if in the emptiness of inherent existence beings are not apprehended, nor is anything at all apprehended, nor is any nonexistent apprehended—how then, Blessed Lord, do bodhisattva great beings embark on all-aspect omniscience?” “

source: །ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ།
en: All phenomena are empty of inherent existence.

source: རང་བཞིན་སྟོང་པ་ཉིད་ལ་ནི་སེམས་ཅན་མི་དམིགས་སོ། །ཆོས་མི་དམིགས་སོ། །ཆོས་མ་ཡིན་པ་མི་དམིགས་སོ།
en: In the emptiness of inherent existence beings are not apprehended, nor is anything apprehended, nor is any nonexistent apprehended.

source: །རབ་འབྱོར་གལ་ཏེ་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྟོང་པ་ཞིག་མ་ཡིན་ན་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་རང་བཞིན་སྟོང་པ་ཉིད་ལ་གནས་པར་མི་འགྱུར་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་ཆོས་རྣམས་རང་བཞིན་གྱིས་སྟོང་པར་མི་སྟོན་ཏོ།
en: Subhūti, if all phenomena were not empty of inherent existence, bodhisattva great beings would not dwell in the emptiness of inherent existence, and, even after attaining consummate buddhahood in unsurpassed, complete enlightenment, they would not teach that all phenomena are empty of inherent existence. “

source: །རང་བཞིན་གྱིས་སྟོང་པའི་ཆོས་དེ་དག་ཀྱང་གང་ཞེ་ན། རབ་འབྱོར་གཟུགས་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་།
en: Subhūti, if you ask what are those phenomena that are empty of inherent existence, it is the case, Subhūti, that physical forms are empty of inherent existence.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་།
en: Feelings, perceptions, formative predispositions, and consciousness are empty of inherent existence.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་། །ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་།
en: The sense fields, the sensory elements, and the links of dependent origination are empty of inherent existence.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། སྟོང་པ་ཉིད་དང་།
en: The perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment are empty of inherent existence.

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways are empty of inherent existence.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་།
en: The powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, great empathetic joy, great equanimity, and the distinct qualities of the buddhas are empty of inherent existence.

source: དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་། མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་།
en: The thirty-two major marks of a great person and the eighty excellent minor marks are empty of inherent existence.

source: །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་།
en: The fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, and individual enlightenment are empty of inherent existence. [

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་།
en: The goals], up to and including all-aspect omniscience, are empty of inherent existence. “

source: །དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཕུང་པོ་ལྔ་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་ཞེས་བྱ་བར་ཆོས་སྟོན་ཏོ།
en: Therefore, when bodhisattva great beings practice the perfection of wisdom, they teach the Dharma that the five psycho-physical aggregates are empty of inherent existence.

source: །སྐྱེ་མཆེད་བཅུ་གཉིས་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་ཞེས་བྱ་བར་ཆོས་སྟོན་ཏོ།
en: They teach the Dharma that the twelve sense fields are empty of inherent existence.

source: །ཁམས་བཅྭོ་བརྒྱད་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་ཞེས་བྱ་བར་ཆོས་སྟོན་ཏོ།
en: They teach the Dharma that the eighteen sensory elements are empty of inherent existence.

source: །རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་ཞེས་བྱ་བར་ཆོས་སྟོན་ཏོ།
en: They teach the Dharma that the links of dependent origination are empty of inherent existence.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་ཞེས་བྱ་བར་ཆོས་སྟོན་ཏོ།
en: They teach the Dharma that all the perfections are empty of inherent existence.

source: །སྟོང་པ་ཉིད་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་ཞེས་བྱ་བར་ཆོས་སྟོན་ཏོ། །དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་།
en: They teach the Dharma that all the aspects of emptiness are empty of inherent existence.

source: ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་ཞེས་བྱ་བར་ཆོས་སྟོན་ཏོ། །འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་།
en: They teach the Dharma that the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path are empty of inherent existence.

source: ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་ཞེས་བྱ་བར་ཆོས་སྟོན་ཏོ།
en: They teach the Dharma that the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the five extrasensory powers, all the meditative stabilities, and all the dhāraṇī gateways are empty of inherent existence.

source: དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོ་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་ཞེས་བྱ་བར་ཆོས་སྟོན་ཏོ། །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་ཞེས་བྱ་བར་ཆོས་སྟོན་ཏོ།
en: They teach the Dharma that the eighteen distinct qualities of the buddhas are empty of inherent existence.

source: །མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་ཞེས་བྱ་བར་ཆོས་སྟོན་ཏོ།
en: They teach the Dharma that the thirty-two major marks of a great person and the eighty excellent minor marks are empty of inherent existence.

source: །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་ཞེས་བྱ་བར་ཆོས་སྟོན་ཏོ།
en: They teach the Dharma that the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, and individual enlightenment are empty of inherent existence.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་སྤོང་བ་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་ཞེས་བྱ་བར་ཆོས་སྟོན་ཏོ།
en: They teach the Dharma that all-aspect omniscience and the abandoning of all the connecting propensities are empty of inherent existence. “
